pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimize_block.cpp
GALGAS_symbolTableForBlockOptimization_2E_element cEnumerator_symbolTableForBlockOptimization::current (LOCATION_ARGS) const {
  const cMapElement_symbolTableForBlockOptimization * p = (const cMapElement_symbolTableForBlockOptimization *) currentObjectPtr (THERE) ;
  macroValidSharedObject (p, const cMapElement_symbolTableForBlockOptimization) ;
  return GALGAS_symbolTableForBlockOptimization_2E_element (p->mAttribute_lkey, p->mAttribute_mDefinitionBlockIndex) ;
}

//---------------------------------------------------------------------------*

GALGAS_lstring cEnumerator_symbolTableForBlockOptimization::current_lkey (LOCATION_ARGS) const {
  const cMapElement * p = (const cMapElement *) currentObjectPtr (THERE) ;
  macroValidSharedObject (p, const cMapElement) ;
  return p->mAttribute_lkey ;
}

//---------------------------------------------------------------------------*

GALGAS_uint cEnumerator_symbolTableForBlockOptimization::current_mDefinitionBlockIndex (LOCATION_ARGS) const {
  const cMapElement_symbolTableForBlockOptimization * p = (const cMapElement_symbolTableForBlockOptimization *) currentObjectPtr (THERE) ;
  macroValidSharedObject (p, const cMapElement_symbolTableForBlockOptimization) ;
  return p->mAttribute_mDefinitionBlockIndex ;
}



//---------------------------------------------------------------------------*
//                                                                           *
//                   @symbolTableForBlockOptimization type                   *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_symbolTableForBlockOptimization ("symbolTableForBlockOptimization",
                                                        NULL) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_symbolTableForBlockOptimization::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_symbolTableForBlockOptimization ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_symbolTableForBlockOptimization::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_symbolTableForBlockOptimization (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_symbolTableForBlockOptimization GALGAS_symbolTableForBlockOptimization::extractObject (const GALGAS_object & inObject,
                                                                                              C_Compiler * inCompiler
                                                                                              COMMA_LOCATION_ARGS) {
  GALGAS_symbolTableForBlockOptimization result ;
  const GALGAS_symbolTableForBlockOptimization * p = (const GALGAS_symbolTableForBlockOptimization *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_symbolTableForBlockOptimization *> (p)) {
      result = *p ;
    }else{
      inCompiler->castError ("symbolTableForBlockOptimization", p->dynamicTypeDescriptor () COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                      Routine 'ipic18OptimizeBlocks'                       *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_ipic_31__38_OptimizeBlocks (GALGAS_string & ioArgument_ioListFileContents,
                                         GALGAS_ipic_31__38_BlockList & ioArgument_ioGeneratedBlockList,
                                         C_Compiler * inCompiler
                                         COMMA_UNUSED_LOCATION_ARGS) {
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string::makeEmptyString ().reader_stringByLeftAndRightPadding (GALGAS_uint ((PMUInt32) 79U), GALGAS_char (TO_UNICODE (42)) COMMA_SOURCE_FILE_AT_LINE (762)).operator_concat (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (762)) COMMA_SOURCE_FILE_AT_LINE (762)) ;
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("*").operator_concat (GALGAS_string ("BLOCK REPRESENTATION OPTIMIZATION").reader_stringByLeftAndRightPadding (GALGAS_uint ((PMUInt32) 77U), GALGAS_char (TO_UNICODE (32)) COMMA_SOURCE_FILE_AT_LINE (763)) COMMA_SOURCE_FILE_AT_LINE (763)).operator_concat (GALGAS_string ("*\n") COMMA_SOURCE_FILE_AT_LINE (763)) COMMA_SOURCE_FILE_AT_LINE (763)) ;
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string::makeEmptyString ().reader_stringByLeftAndRightPadding (GALGAS_uint ((PMUInt32) 79U), GALGAS_char (TO_UNICODE (42)) COMMA_SOURCE_FILE_AT_LINE (764)).operator_concat (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (764)) COMMA_SOURCE_FILE_AT_LINE (764)) ;
  inCompiler->printMessage (GALGAS_string ("Optimizations:\n") COMMA_SOURCE_FILE_AT_LINE (765)) ;
  GALGAS_bool var_optimizationDone = GALGAS_bool (true) ;
  GALGAS_uint var_optimizationPass = GALGAS_uint ((PMUInt32) 0U) ;
  if (ioArgument_ioGeneratedBlockList.reader_length (SOURCE_FILE_AT_LINE (769)).add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (769)).isValid ()) {
    PMUInt32 variant_25931 = ioArgument_ioGeneratedBlockList.reader_length (SOURCE_FILE_AT_LINE (769)).add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (769)).uintValue () ;
    bool loop_25931 = true ;
    while (loop_25931) {
      loop_25931 = var_optimizationDone.operator_and (GALGAS_bool (kIsEqual, GALGAS_uint::constructor_errorCount (SOURCE_FILE_AT_LINE (770)).objectCompare (GALGAS_uint ((PMUInt32) 0U))) COMMA_SOURCE_FILE_AT_LINE (770)).isValid () ;
      if (loop_25931) {
        loop_25931 = var_optimizationDone.operator_and (GALGAS_bool (kIsEqual, GALGAS_uint::constructor_errorCount (SOURCE_FILE_AT_LINE (770)).objectCompare (GALGAS_uint ((PMUInt32) 0U))) COMMA_SOURCE_FILE_AT_LINE (770)).boolValue () ;
      }
      if (loop_25931 && (0 == variant_25931)) {
        loop_25931 = false ;
        inCompiler->loopRunTimeVariantError (SOURCE_FILE_AT_LINE (769)) ;
      }
      if (loop_25931) {
        variant_25931 -- ;
        var_optimizationDone = GALGAS_bool (false) ;
        var_optimizationPass = var_optimizationPass.add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (772)) ;
        ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("\n"
          "--- Pass ").operator_concat (var_optimizationPass.reader_string (SOURCE_FILE_AT_LINE (773)) COMMA_SOURCE_FILE_AT_LINE (773)).operator_concat (GALGAS_string (" (") COMMA_SOURCE_FILE_AT_LINE (773)).operator_concat (ioArgument_ioGeneratedBlockList.reader_length (SOURCE_FILE_AT_LINE (773)).reader_string (SOURCE_FILE_AT_LINE (773)) COMMA_SOURCE_FILE_AT_LINE (773)).operator_concat (GALGAS_string (" blocks)\n") COMMA_SOURCE_FILE_AT_LINE (773)) COMMA_SOURCE_FILE_AT_LINE (773)) ;
        inCompiler->printMessage (GALGAS_string ("  Pass ").operator_concat (var_optimizationPass.reader_string (SOURCE_FILE_AT_LINE (774)) COMMA_SOURCE_FILE_AT_LINE (774)).operator_concat (GALGAS_string (" (") COMMA_SOURCE_FILE_AT_LINE (774)).operator_concat (ioArgument_ioGeneratedBlockList.reader_length (SOURCE_FILE_AT_LINE (774)).reader_string (SOURCE_FILE_AT_LINE (774)) COMMA_SOURCE_FILE_AT_LINE (774)).operator_concat (GALGAS_string (" blocks)\n") COMMA_SOURCE_FILE_AT_LINE (774)) COMMA_SOURCE_FILE_AT_LINE (774)) ;
        GALGAS_stringset var_referencedBlockSet = GALGAS_stringset::constructor_emptySet (SOURCE_FILE_AT_LINE (776)) ;
        cEnumerator_ipic_31__38_BlockList enumerator_26456 (ioArgument_ioGeneratedBlockList, kEnumeration_up) ;
        while (enumerator_26456.hasCurrentObject ()) {
          categoryMethod_enterReferencedLabels (enumerator_26456.current_mBlock (HERE), var_referencedBlockSet, inCompiler COMMA_SOURCE_FILE_AT_LINE (778)) ;
          enumerator_26456.gotoNextObject () ;
        }
        GALGAS_symbolTableForBlockOptimization var_symbolTable = GALGAS_symbolTableForBlockOptimization::constructor_emptyMap (SOURCE_FILE_AT_LINE (781)) ;
        cEnumerator_ipic_31__38_BlockList enumerator_26687 (ioArgument_ioGeneratedBlockList, kEnumeration_up) ;
        GALGAS_uint index_26681 ((PMUInt32) 0) ;
        while (enumerator_26687.hasCurrentObject ()) {
          const enumGalgasBool test_0 = GALGAS_bool (kIsNotEqual, enumerator_26687.current_mBlock (HERE).mAttribute_mLabel.mAttribute_string.objectCompare (GALGAS_string::makeEmptyString ())).boolEnum () ;
          if (kBoolTrue == test_0) {
            {
            var_symbolTable.modifier_insertKey (enumerator_26687.current_mBlock (HERE).mAttribute_mLabel, index_26681, inCompiler COMMA_SOURCE_FILE_AT_LINE (784)) ;
            }
          }
          enumerator_26687.gotoNextObject () ;
          index_26681.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (782)) ;
        }
        GALGAS_ipic_31__38_BlockList var_optimizedBlockList = GALGAS_ipic_31__38_BlockList::constructor_emptyList (SOURCE_FILE_AT_LINE (788)) ;
        cEnumerator_ipic_31__38_BlockList enumerator_26985 (ioArgument_ioGeneratedBlockList, kEnumeration_up) ;
        while (enumerator_26985.hasCurrentObject ()) {
          const enumGalgasBool test_1 = var_referencedBlockSet.reader_hasKey (enumerator_26985.current_mBlock (HERE).mAttribute_mLabel.mAttribute_string COMMA_SOURCE_FILE_AT_LINE (790)).operator_or (GALGAS_bool (kIsNotEqual, enumerator_26985.current_mBlock (HERE).mAttribute_mStartAddress.objectCompare (GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (790)))) COMMA_SOURCE_FILE_AT_LINE (790)).boolEnum () ;
          if (kBoolTrue == test_1) {
            GALGAS_ipic_31__38_Block var_optimizedBlock ;
            categoryMethod_optimize (enumerator_26985.current_mBlock (HERE), var_symbolTable, ioArgument_ioGeneratedBlockList, var_optimizationDone, ioArgument_ioListFileContents, var_optimizedBlock, inCompiler COMMA_SOURCE_FILE_AT_LINE (791)) ;
            var_optimizedBlockList.addAssign_operation (var_optimizedBlock COMMA_SOURCE_FILE_AT_LINE (798)) ;
          }else if (kBoolFalse == test_1) {
            ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("  ").operator_concat (enumerator_26985.current_mBlock (HERE).mAttribute_mLabel.reader_string (SOURCE_FILE_AT_LINE (800)) COMMA_SOURCE_FILE_AT_LINE (800)).operator_concat (GALGAS_string (": not referenced, deleted\n") COMMA_SOURCE_FILE_AT_LINE (800)) COMMA_SOURCE_FILE_AT_LINE (800)) ;
            var_optimizationDone = GALGAS_bool (true) ;
          }
          enumerator_26985.gotoNextObject () ;
        }
        ioArgument_ioGeneratedBlockList = var_optimizedBlockList ;
      }
    }
  }
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("  No optimization.\n"
    "\n") COMMA_SOURCE_FILE_AT_LINE (806)) ;
  inCompiler->printMessage (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (807)) ;
}


//---------------------------------------------------------------------------*
//                                                                           *
//     Abstract category method '@ipic18AbstractBlockTerminator display'     *
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_ipic_31__38_AbstractBlockTerminator_display> gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_display ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_display (const PMSInt32 inClassIndex,
                                  categoryMethodSignature_ipic_31__38_AbstractBlockTerminator_display inMethod) {
  gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_display.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_ipic_31__38_AbstractBlockTerminator_display (void) {
  gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_display.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_AbstractBlockTerminator_display (NULL,
                                                                        freeCategoryMethod_ipic_31__38_AbstractBlockTerminator_display) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_display (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                 GALGAS_string & io_ioListFileContents,
                                 C_Compiler * inCompiler
                                 COMMA_LOCATION_ARGS) {
//--- Drop output arguments
//--- Find method
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_ipic_31__38_AbstractBlockTerminator) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_ipic_31__38_AbstractBlockTerminator_display f = NULL ;
    if (classIndex < gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_display.count ()) {
      f = gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_display (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_display.count ()) {
           f = gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_display (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_display.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, io_ioListFileContents, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//       Overriding category method '@ipic18ReturnTerminator display'        *
//                                                                           *
//---------------------------------------------------------------------------*

