pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimize_block.cpp
static void categoryMethod_ipic_31__38_ReturnTerminator_display (const cPtr_ipic_31__38_AbstractBlockTerminator * /* inObject */,
                                                                 GALGAS_string & ioArgument_ioListFileContents,
                                                                 C_Compiler * /* inCompiler */
                                                                 COMMA_UNUSED_LOCATION_ARGS) {
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("RETURN") COMMA_SOURCE_FILE_AT_LINE (20)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_ReturnTerminator_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_ipic_31__38_ReturnTerminator.mSlotID,
                               categoryMethod_ipic_31__38_ReturnTerminator_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_ReturnTerminator_display (defineCategoryMethod_ipic_31__38_ReturnTerminator_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//        Overriding category method '@ipic18RetlwTerminator display'        *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_RetlwTerminator_display (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                GALGAS_string & ioArgument_ioListFileContents,
                                                                C_Compiler * /* inCompiler */
                                                                COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_ipic_31__38_RetlwTerminator * object = (const cPtr_ipic_31__38_RetlwTerminator *) inObject ;
  macroValidSharedObject (object, const cPtr_ipic_31__38_RetlwTerminator) ;
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("RETLW ").operator_concat (object->mAttribute_mLiteralValue.reader_hexString (SOURCE_FILE_AT_LINE (28)) COMMA_SOURCE_FILE_AT_LINE (28)) COMMA_SOURCE_FILE_AT_LINE (28)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_RetlwTerminator_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_ipic_31__38_RetlwTerminator.mSlotID,
                               categoryMethod_ipic_31__38_RetlwTerminator_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_RetlwTerminator_display (defineCategoryMethod_ipic_31__38_RetlwTerminator_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//       Overriding category method '@ipic18RetfieTerminator display'        *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_RetfieTerminator_display (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                 GALGAS_string & ioArgument_ioListFileContents,
                                                                 C_Compiler * /* inCompiler */
                                                                 COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_ipic_31__38_RetfieTerminator * object = (const cPtr_ipic_31__38_RetfieTerminator *) inObject ;
  macroValidSharedObject (object, const cPtr_ipic_31__38_RetfieTerminator) ;
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("RETFIE") COMMA_SOURCE_FILE_AT_LINE (36)) ;
  const enumGalgasBool test_0 = object->mAttribute_mFastReturn.boolEnum () ;
  if (kBoolTrue == test_0) {
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" FAST") COMMA_SOURCE_FILE_AT_LINE (38)) ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_RetfieTerminator_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_ipic_31__38_RetfieTerminator.mSlotID,
                               categoryMethod_ipic_31__38_RetfieTerminator_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_RetfieTerminator_display (defineCategoryMethod_ipic_31__38_RetfieTerminator_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//        Overriding category method '@ipic18JumpTerminator display'         *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_JumpTerminator_display (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                               GALGAS_string & ioArgument_ioListFileContents,
                                                               C_Compiler * /* inCompiler */
                                                               COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_ipic_31__38_JumpTerminator * object = (const cPtr_ipic_31__38_JumpTerminator *) inObject ;
  macroValidSharedObject (object, const cPtr_ipic_31__38_JumpTerminator) ;
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("JUMP ").operator_concat (object->mAttribute_mLabel.reader_string (SOURCE_FILE_AT_LINE (47)) COMMA_SOURCE_FILE_AT_LINE (47)) COMMA_SOURCE_FILE_AT_LINE (47)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_JumpTerminator_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_ipic_31__38_JumpTerminator.mSlotID,
                               categoryMethod_ipic_31__38_JumpTerminator_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_JumpTerminator_display (defineCategoryMethod_ipic_31__38_JumpTerminator_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//    Overriding category method '@ipic18ComputedGotoTerminator display'     *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_ComputedGotoTerminator_display (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                       GALGAS_string & ioArgument_ioListFileContents,
                                                                       C_Compiler * /* inCompiler */
                                                                       COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_ipic_31__38_ComputedGotoTerminator * object = (const cPtr_ipic_31__38_ComputedGotoTerminator *) inObject ;
  macroValidSharedObject (object, const cPtr_ipic_31__38_ComputedGotoTerminator) ;
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("COMPUTED GOTO ") COMMA_SOURCE_FILE_AT_LINE (53)) ;
  const enumGalgasBool test_0 = object->mAttribute_mUsesRCALL.boolEnum () ;
  if (kBoolTrue == test_0) {
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" (uses RCALL)") COMMA_SOURCE_FILE_AT_LINE (55)) ;
  }else if (kBoolFalse == test_0) {
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" (uses CALL)") COMMA_SOURCE_FILE_AT_LINE (57)) ;
  }
  cEnumerator_lstringlist enumerator_1698 (object->mAttribute_mTargetLabels, kEnumeration_up) ;
  while (enumerator_1698.hasCurrentObject ()) {
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("\n"
      "    ").operator_concat (enumerator_1698.current_mValue (HERE).reader_string (SOURCE_FILE_AT_LINE (60)) COMMA_SOURCE_FILE_AT_LINE (60)) COMMA_SOURCE_FILE_AT_LINE (60)) ;
    enumerator_1698.gotoNextObject () ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_ComputedGotoTerminator_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_ipic_31__38_ComputedGotoTerminator.mSlotID,
                               categoryMethod_ipic_31__38_ComputedGotoTerminator_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_ComputedGotoTerminator_display (defineCategoryMethod_ipic_31__38_ComputedGotoTerminator_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//    Overriding category method '@ipic18ComputedRETLWTerminator display'    *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_ComputedRETLWTerminator_display (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                        GALGAS_string & ioArgument_ioListFileContents,
                                                                        C_Compiler * /* inCompiler */
                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_ipic_31__38_ComputedRETLWTerminator * object = (const cPtr_ipic_31__38_ComputedRETLWTerminator *) inObject ;
  macroValidSharedObject (object, const cPtr_ipic_31__38_ComputedRETLWTerminator) ;
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("COMPUTED RETLW ") COMMA_SOURCE_FILE_AT_LINE (67)) ;
  const enumGalgasBool test_0 = object->mAttribute_mUsesRCALL.boolEnum () ;
  if (kBoolTrue == test_0) {
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" (uses RCALL)") COMMA_SOURCE_FILE_AT_LINE (69)) ;
  }else if (kBoolFalse == test_0) {
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" (uses CALL)") COMMA_SOURCE_FILE_AT_LINE (71)) ;
  }
  cEnumerator_uintlist enumerator_2138 (object->mAttribute_mLiteralValues, kEnumeration_up) ;
  while (enumerator_2138.hasCurrentObject ()) {
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("\n"
      "    ").operator_concat (enumerator_2138.current_mValue (HERE).reader_hexString (SOURCE_FILE_AT_LINE (74)) COMMA_SOURCE_FILE_AT_LINE (74)) COMMA_SOURCE_FILE_AT_LINE (74)) ;
    enumerator_2138.gotoNextObject () ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_ComputedRETLWTerminator_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_ipic_31__38_ComputedRETLWTerminator.mSlotID,
                               categoryMethod_ipic_31__38_ComputedRETLWTerminator_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_ComputedRETLWTerminator_display (defineCategoryMethod_ipic_31__38_ComputedRETLWTerminator_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//   Overriding category method '@ipic18ConditionalJumpTerminator display'   *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_ConditionalJumpTerminator_display (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                          GALGAS_string & ioArgument_ioListFileContents,
                                                                          C_Compiler * inCompiler
                                                                          COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_ipic_31__38_ConditionalJumpTerminator * object = (const cPtr_ipic_31__38_ConditionalJumpTerminator *) inObject ;
  macroValidSharedObject (object, const cPtr_ipic_31__38_ConditionalJumpTerminator) ;
  ioArgument_ioListFileContents.dotAssign_operation (categoryReader_condition (object->mAttribute_mConditionalBranch, inCompiler COMMA_SOURCE_FILE_AT_LINE (81)) COMMA_SOURCE_FILE_AT_LINE (81)) ;
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" \? ") COMMA_SOURCE_FILE_AT_LINE (82)) ;
  callCategoryMethod_display ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionTrue.ptr (), ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (83)) ;
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" : ") COMMA_SOURCE_FILE_AT_LINE (84)) ;
  callCategoryMethod_display ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionFalse.ptr (), ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (85)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_ConditionalJumpTerminator_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_ipic_31__38_ConditionalJumpTerminator.mSlotID,
                               categoryMethod_ipic_31__38_ConditionalJumpTerminator_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_ConditionalJumpTerminator_display (defineCategoryMethod_ipic_31__38_ConditionalJumpTerminator_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//     Overriding category method '@ipic18ComputedBraTerminator display'     *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_ComputedBraTerminator_display (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                      GALGAS_string & ioArgument_ioListFileContents,
                                                                      C_Compiler * /* inCompiler */
                                                                      COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_ipic_31__38_ComputedBraTerminator * object = (const cPtr_ipic_31__38_ComputedBraTerminator *) inObject ;
  macroValidSharedObject (object, const cPtr_ipic_31__38_ComputedBraTerminator) ;
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("COMPUTED BRA ") COMMA_SOURCE_FILE_AT_LINE (91)) ;
  const enumGalgasBool test_0 = object->mAttribute_mUsesRCALL.boolEnum () ;
  if (kBoolTrue == test_0) {
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" (uses RCALL)") COMMA_SOURCE_FILE_AT_LINE (93)) ;
  }else if (kBoolFalse == test_0) {
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" (uses CALL)") COMMA_SOURCE_FILE_AT_LINE (95)) ;
  }
  cEnumerator_lstringlist enumerator_3015 (object->mAttribute_mTargetLabels, kEnumeration_up) ;
  while (enumerator_3015.hasCurrentObject ()) {
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("\n"
      "    ").operator_concat (enumerator_3015.current_mValue (HERE).reader_string (SOURCE_FILE_AT_LINE (98)) COMMA_SOURCE_FILE_AT_LINE (98)) COMMA_SOURCE_FILE_AT_LINE (98)) ;
    enumerator_3015.gotoNextObject () ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_ComputedBraTerminator_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_ipic_31__38_ComputedBraTerminator.mSlotID,
                               categoryMethod_ipic_31__38_ComputedBraTerminator_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_ComputedBraTerminator_display (defineCategoryMethod_ipic_31__38_ComputedBraTerminator_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//        Overriding category method '@pic18BraCCTerminator display'         *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38_BraCCTerminator_display (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                               GALGAS_string & ioArgument_ioListFileContents,
                                                               C_Compiler * inCompiler
                                                               COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38_BraCCTerminator * object = (const cPtr_pic_31__38_BraCCTerminator *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38_BraCCTerminator) ;
  ioArgument_ioListFileContents.dotAssign_operation (categoryReader_condition (object->mAttribute_mConditionalBranch, inCompiler COMMA_SOURCE_FILE_AT_LINE (105)).operator_concat (GALGAS_string (" \? ") COMMA_SOURCE_FILE_AT_LINE (105)) COMMA_SOURCE_FILE_AT_LINE (105)) ;
  callCategoryMethod_display ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionTrue.ptr (), ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (106)) ;
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" : ") COMMA_SOURCE_FILE_AT_LINE (107)) ;
  callCategoryMethod_display ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionFalse.ptr (), ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (108)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38_BraCCTerminator_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38_BraCCTerminator.mSlotID,
                               categoryMethod_pic_31__38_BraCCTerminator_display) ;
}

//---------------------------------------------------------------------------*

