pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimize_block.cpp
C_PrologueEpilogue gMethod_pic_31__38_BraCCTerminator_display (defineCategoryMethod_pic_31__38_BraCCTerminator_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//  Overriding category method '@pic18RegisterComparisonTerminator display'  *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38_RegisterComparisonTerminator_display (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                            GALGAS_string & ioArgument_ioListFileContents,
                                                                            C_Compiler * inCompiler
                                                                            COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38_RegisterComparisonTerminator * object = (const cPtr_pic_31__38_RegisterComparisonTerminator *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38_RegisterComparisonTerminator) ;
  ioArgument_ioListFileContents.dotAssign_operation (object->mAttribute_mRegisterDescription.reader_mAssemblyString (SOURCE_FILE_AT_LINE (114)).operator_concat (GALGAS_string (" ") COMMA_SOURCE_FILE_AT_LINE (114)).operator_concat (categoryReader_mnemonic (object->mAttribute_mComparison, inCompiler COMMA_SOURCE_FILE_AT_LINE (114)) COMMA_SOURCE_FILE_AT_LINE (114)).operator_concat (GALGAS_string (" \? ") COMMA_SOURCE_FILE_AT_LINE (114)) COMMA_SOURCE_FILE_AT_LINE (114)) ;
  callCategoryMethod_display ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionTrue.ptr (), ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (115)) ;
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" : ") COMMA_SOURCE_FILE_AT_LINE (116)) ;
  callCategoryMethod_display ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionFalse.ptr (), ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (117)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38_RegisterComparisonTerminator_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38_RegisterComparisonTerminator.mSlotID,
                               categoryMethod_pic_31__38_RegisterComparisonTerminator_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38_RegisterComparisonTerminator_display (defineCategoryMethod_pic_31__38_RegisterComparisonTerminator_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//   Overriding category method '@ipic18IncDecRegisterTerminator display'    *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_IncDecRegisterTerminator_display (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                         GALGAS_string & ioArgument_ioListFileContents,
                                                                         C_Compiler * inCompiler
                                                                         COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_ipic_31__38_IncDecRegisterTerminator * object = (const cPtr_ipic_31__38_IncDecRegisterTerminator *) inObject ;
  macroValidSharedObject (object, const cPtr_ipic_31__38_IncDecRegisterTerminator) ;
  const enumGalgasBool test_0 = object->mAttribute_mIncrement.boolEnum () ;
  if (kBoolTrue == test_0) {
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("INCF ") COMMA_SOURCE_FILE_AT_LINE (124)) ;
  }else if (kBoolFalse == test_0) {
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("DECF ") COMMA_SOURCE_FILE_AT_LINE (126)) ;
  }
  ioArgument_ioListFileContents.dotAssign_operation (object->mAttribute_mRegisterDescription.reader_mAssemblyString (SOURCE_FILE_AT_LINE (128)) COMMA_SOURCE_FILE_AT_LINE (128)) ;
  const enumGalgasBool test_1 = object->mAttribute_m_5F_W_5F_isDestination.boolEnum () ;
  if (kBoolTrue == test_1) {
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (", W") COMMA_SOURCE_FILE_AT_LINE (130)) ;
  }
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" Z \? ") COMMA_SOURCE_FILE_AT_LINE (132)) ;
  callCategoryMethod_display ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionTrue.ptr (), ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (133)) ;
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" : ") COMMA_SOURCE_FILE_AT_LINE (134)) ;
  callCategoryMethod_display ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionFalse.ptr (), ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (135)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_IncDecRegisterTerminator_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_ipic_31__38_IncDecRegisterTerminator.mSlotID,
                               categoryMethod_ipic_31__38_IncDecRegisterTerminator_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_IncDecRegisterTerminator_display (defineCategoryMethod_ipic_31__38_IncDecRegisterTerminator_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//     Overriding category method '@pic18TestRegisterTerminator display'     *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38_TestRegisterTerminator_display (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                      GALGAS_string & ioArgument_ioListFileContents,
                                                                      C_Compiler * inCompiler
                                                                      COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38_TestRegisterTerminator * object = (const cPtr_pic_31__38_TestRegisterTerminator *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38_TestRegisterTerminator) ;
  ioArgument_ioListFileContents.dotAssign_operation (object->mAttribute_mRegisterDescription.reader_mAssemblyString (SOURCE_FILE_AT_LINE (141)) COMMA_SOURCE_FILE_AT_LINE (141)) ;
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" Z \? ") COMMA_SOURCE_FILE_AT_LINE (142)) ;
  callCategoryMethod_display ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionTrue.ptr (), ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (143)) ;
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" : ") COMMA_SOURCE_FILE_AT_LINE (144)) ;
  callCategoryMethod_display ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionFalse.ptr (), ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (145)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38_TestRegisterTerminator_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38_TestRegisterTerminator.mSlotID,
                               categoryMethod_pic_31__38_TestRegisterTerminator_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38_TestRegisterTerminator_display (defineCategoryMethod_pic_31__38_TestRegisterTerminator_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//       Overriding category method '@pic18BitTestTerminator display'        *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38_BitTestTerminator_display (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                 GALGAS_string & ioArgument_ioListFileContents,
                                                                 C_Compiler * inCompiler
                                                                 COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38_BitTestTerminator * object = (const cPtr_pic_31__38_BitTestTerminator *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38_BitTestTerminator) ;
  ioArgument_ioListFileContents.dotAssign_operation (object->mAttribute_mRegisterDescription.reader_mAssemblyString (SOURCE_FILE_AT_LINE (151)).operator_concat (GALGAS_string (".") COMMA_SOURCE_FILE_AT_LINE (151)).operator_concat (object->mAttribute_mBitNumber.reader_string (SOURCE_FILE_AT_LINE (151)) COMMA_SOURCE_FILE_AT_LINE (151)).operator_concat (GALGAS_string (" \? ") COMMA_SOURCE_FILE_AT_LINE (151)) COMMA_SOURCE_FILE_AT_LINE (151)) ;
  callCategoryMethod_display ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionTrue.ptr (), ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (152)) ;
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" : ") COMMA_SOURCE_FILE_AT_LINE (153)) ;
  callCategoryMethod_display ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionFalse.ptr (), ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (154)) ;
}
//---------------------------------------------------------------------------*

