pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimize_block.cpp
static void defineCategoryMethod_pic_31__38_BitTestTerminator_display (void) {
  enterCategoryMethod_display (kTypeDescriptor_GALGAS_pic_31__38_BitTestTerminator.mSlotID,
                               categoryMethod_pic_31__38_BitTestTerminator_display) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38_BitTestTerminator_display (defineCategoryMethod_pic_31__38_BitTestTerminator_display, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Abstract category method '@ipic18AbstractBlockTerminator optimizeTerminator'*
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_ipic_31__38_AbstractBlockTerminator_optimizeTerminator> gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_optimizeTerminator ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_optimizeTerminator (const PMSInt32 inClassIndex,
                                             categoryMethodSignature_ipic_31__38_AbstractBlockTerminator_optimizeTerminator inMethod) {
  gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_optimizeTerminator.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_ipic_31__38_AbstractBlockTerminator_optimizeTerminator (void) {
  gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_optimizeTerminator.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_AbstractBlockTerminator_optimizeTerminator (NULL,
                                                                                   freeCategoryMethod_ipic_31__38_AbstractBlockTerminator_optimizeTerminator) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_optimizeTerminator (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                            const GALGAS_symbolTableForBlockOptimization constin_inSymbolTable,
                                            const GALGAS_ipic_31__38_BlockList constin_inBlockList,
                                            const GALGAS_string constin_inBlockLabel,
                                            GALGAS_bool & io_ioOptimizationDone,
                                            GALGAS_string & io_ioListFileContents,
                                            GALGAS_ipic_31__38_AbstractBlockTerminator & out_outOptimizedTerminator,
                                            C_Compiler * inCompiler
                                            COMMA_LOCATION_ARGS) {
//--- Drop output arguments
  out_outOptimizedTerminator.drop () ;
//--- Find method
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_ipic_31__38_AbstractBlockTerminator) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_ipic_31__38_AbstractBlockTerminator_optimizeTerminator f = NULL ;
    if (classIndex < gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_optimizeTerminator.count ()) {
      f = gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_optimizeTerminator (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_optimizeTerminator.count ()) {
           f = gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_optimizeTerminator (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_ipic_31__38_AbstractBlockTerminator_optimizeTerminator.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, constin_inSymbolTable, constin_inBlockList, constin_inBlockLabel, io_ioOptimizationDone, io_ioListFileContents, out_outOptimizedTerminator, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@ipic18ComputedBraTerminator optimizeTerminator'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_ComputedBraTerminator_optimizeTerminator (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                                 const GALGAS_symbolTableForBlockOptimization /* constinArgument_inSymbolTable */,
                                                                                 const GALGAS_ipic_31__38_BlockList /* constinArgument_inBlockList */,
                                                                                 const GALGAS_string /* constinArgument_inBlockLabel */,
                                                                                 GALGAS_bool & /* ioArgument_ioOptimizationDone */,
                                                                                 GALGAS_string & /* ioArgument_ioListFileContents */,
                                                                                 GALGAS_ipic_31__38_AbstractBlockTerminator & outArgument_outOptimizedTerminator,
                                                                                 C_Compiler * /* inCompiler */
                                                                                 COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_ipic_31__38_ComputedBraTerminator * object = (const cPtr_ipic_31__38_ComputedBraTerminator *) inObject ;
  macroValidSharedObject (object, const cPtr_ipic_31__38_ComputedBraTerminator) ;
  //--- @selfCopyInExpressionForGeneration
  const GALGAS_ipic_31__38_ComputedBraTerminator temp_0 = object ;
  outArgument_outOptimizedTerminator = temp_0 ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_ComputedBraTerminator_optimizeTerminator (void) {
  enterCategoryMethod_optimizeTerminator (kTypeDescriptor_GALGAS_ipic_31__38_ComputedBraTerminator.mSlotID,
                                          categoryMethod_ipic_31__38_ComputedBraTerminator_optimizeTerminator) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_ComputedBraTerminator_optimizeTerminator (defineCategoryMethod_ipic_31__38_ComputedBraTerminator_optimizeTerminator, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@ipic18ComputedGotoTerminator optimizeTerminator'*
//                                                                           *
//---------------------------------------------------------------------------*

