pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimize_block.cpp
static void categoryMethod_ipic_31__38_AbstractConditionTerminator_getOptimizedTerminators (const cPtr_ipic_31__38_AbstractConditionTerminator * inObject,
                                                                                            const GALGAS_symbolTableForBlockOptimization constinArgument_inSymbolTable,
                                                                                            const GALGAS_ipic_31__38_BlockList constinArgument_inBlockList,
                                                                                            const GALGAS_string constinArgument_inBlockLabel,
                                                                                            GALGAS_bool & ioArgument_ioOptimizationDone,
                                                                                            GALGAS_string & ioArgument_ioListFileContents,
                                                                                            GALGAS_ipic_31__38_SingleInstructionTerminator & outArgument_outOptimizedTrueTerminator,
                                                                                            GALGAS_ipic_31__38_SingleInstructionTerminator & outArgument_outOptimizedFalseTerminator,
                                                                                            C_Compiler * inCompiler
                                                                                            COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_ipic_31__38_AbstractConditionTerminator * object = inObject ;
  macroValidSharedObject (object, const cPtr_ipic_31__38_AbstractConditionTerminator) ;
  GALGAS_ipic_31__38_AbstractBlockTerminator var_optimizedTrueTerminator ;
  callCategoryMethod_optimizeTerminator ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionTrue.ptr (), constinArgument_inSymbolTable, constinArgument_inBlockList, constinArgument_inBlockLabel, ioArgument_ioOptimizationDone, ioArgument_ioListFileContents, var_optimizedTrueTerminator, inCompiler COMMA_SOURCE_FILE_AT_LINE (236)) ;
  GALGAS_ipic_31__38_SingleInstructionTerminator temp_0 ;
  if (var_optimizedTrueTerminator.isValid ()) {
    if (NULL != dynamic_cast <const cPtr_ipic_31__38_SingleInstructionTerminator *> (var_optimizedTrueTerminator.ptr ())) {
      temp_0 = (cPtr_ipic_31__38_SingleInstructionTerminator *) var_optimizedTrueTerminator.ptr () ;
    }else{
      inCompiler->castError ("ipic_31__38_SingleInstructionTerminator", var_optimizedTrueTerminator.ptr ()->classDescriptor () COMMA_SOURCE_FILE_AT_LINE (244)) ;
    }
  }
  outArgument_outOptimizedTrueTerminator = temp_0 ;
  GALGAS_ipic_31__38_AbstractBlockTerminator var_optimizedFalseTerminator ;
  callCategoryMethod_optimizeTerminator ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionFalse.ptr (), constinArgument_inSymbolTable, constinArgument_inBlockList, constinArgument_inBlockLabel, ioArgument_ioOptimizationDone, ioArgument_ioListFileContents, var_optimizedFalseTerminator, inCompiler COMMA_SOURCE_FILE_AT_LINE (246)) ;
  GALGAS_ipic_31__38_SingleInstructionTerminator temp_1 ;
  if (var_optimizedFalseTerminator.isValid ()) {
    if (NULL != dynamic_cast <const cPtr_ipic_31__38_SingleInstructionTerminator *> (var_optimizedFalseTerminator.ptr ())) {
      temp_1 = (cPtr_ipic_31__38_SingleInstructionTerminator *) var_optimizedFalseTerminator.ptr () ;
    }else{
      inCompiler->castError ("ipic_31__38_SingleInstructionTerminator", var_optimizedFalseTerminator.ptr ()->classDescriptor () COMMA_SOURCE_FILE_AT_LINE (254)) ;
    }
  }
  outArgument_outOptimizedFalseTerminator = temp_1 ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_AbstractConditionTerminator_getOptimizedTerminators (void) {
  enterCategoryMethod_getOptimizedTerminators (kTypeDescriptor_GALGAS_ipic_31__38_AbstractConditionTerminator.mSlotID,
                                               categoryMethod_ipic_31__38_AbstractConditionTerminator_getOptimizedTerminators) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_ipic_31__38_AbstractConditionTerminator_getOptimizedTerminators (void) {
  gCategoryMethodTable_ipic_31__38_AbstractConditionTerminator_getOptimizedTerminators.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_AbstractConditionTerminator_getOptimizedTerminators (defineCategoryMethod_ipic_31__38_AbstractConditionTerminator_getOptimizedTerminators,
                                                                                            freeCategoryMethod_ipic_31__38_AbstractConditionTerminator_getOptimizedTerminators) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@ipic18ConditionalJumpTerminator optimizeTerminator'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_ConditionalJumpTerminator_optimizeTerminator (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                                     const GALGAS_symbolTableForBlockOptimization constinArgument_inSymbolTable,
                                                                                     const GALGAS_ipic_31__38_BlockList constinArgument_inBlockList,
                                                                                     const GALGAS_string constinArgument_inBlockLabel,
                                                                                     GALGAS_bool & ioArgument_ioOptimizationDone,
                                                                                     GALGAS_string & ioArgument_ioListFileContents,
                                                                                     GALGAS_ipic_31__38_AbstractBlockTerminator & outArgument_outOptimizedTerminator,
                                                                                     C_Compiler * inCompiler
                                                                                     COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_ipic_31__38_ConditionalJumpTerminator * object = (const cPtr_ipic_31__38_ConditionalJumpTerminator *) inObject ;
  macroValidSharedObject (object, const cPtr_ipic_31__38_ConditionalJumpTerminator) ;
  GALGAS_bool var_optimization = GALGAS_bool (false) ;
  GALGAS_ipic_31__38_SingleInstructionTerminator var_optimizedTrueTerminator ;
  GALGAS_ipic_31__38_SingleInstructionTerminator var_optimizedFalseTerminator ;
  //--- @selfCopyInExpressionForGeneration
  const GALGAS_ipic_31__38_ConditionalJumpTerminator temp_0 = object ;
  callCategoryMethod_getOptimizedTerminators ((const cPtr_ipic_31__38_ConditionalJumpTerminator *) temp_0.ptr (), constinArgument_inSymbolTable, constinArgument_inBlockList, constinArgument_inBlockLabel, var_optimization, ioArgument_ioListFileContents, var_optimizedTrueTerminator, var_optimizedFalseTerminator, inCompiler COMMA_SOURCE_FILE_AT_LINE (269)) ;
  const enumGalgasBool test_1 = var_optimization.boolEnum () ;
  if (kBoolTrue == test_1) {
    outArgument_outOptimizedTerminator = GALGAS_ipic_31__38_ConditionalJumpTerminator::constructor_new (var_optimizedTrueTerminator, var_optimizedFalseTerminator, object->mAttribute_mBranchMode, object->mAttribute_mConditionalBranch COMMA_SOURCE_FILE_AT_LINE (279)) ;
    ioArgument_ioOptimizationDone = GALGAS_bool (true) ;
  }else if (kBoolFalse == test_1) {
    //--- @selfCopyInExpressionForGeneration
    const GALGAS_ipic_31__38_ConditionalJumpTerminator temp_2 = object ;
    outArgument_outOptimizedTerminator = temp_2 ;
  }
}
//---------------------------------------------------------------------------*

