pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimize_block.cpp
C_PrologueEpilogue gMethod_pic_31__38_BitTestTerminator_optimizeTerminator (defineCategoryMethod_pic_31__38_BitTestTerminator_optimizeTerminator, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//   Overriding category method '@pic18BraCCTerminator optimizeTerminator'   *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38_BraCCTerminator_optimizeTerminator (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                          const GALGAS_symbolTableForBlockOptimization constinArgument_inSymbolTable,
                                                                          const GALGAS_ipic_31__38_BlockList constinArgument_inBlockList,
                                                                          const GALGAS_string constinArgument_inBlockLabel,
                                                                          GALGAS_bool & ioArgument_ioOptimizationDone,
                                                                          GALGAS_string & ioArgument_ioListFileContents,
                                                                          GALGAS_ipic_31__38_AbstractBlockTerminator & outArgument_outOptimizedTerminator,
                                                                          C_Compiler * inCompiler
                                                                          COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38_BraCCTerminator * object = (const cPtr_pic_31__38_BraCCTerminator *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38_BraCCTerminator) ;
  GALGAS_bool var_optimization = GALGAS_bool (false) ;
  GALGAS_ipic_31__38_SingleInstructionTerminator var_optimizedTrueTerminator ;
  GALGAS_ipic_31__38_SingleInstructionTerminator var_optimizedFalseTerminator ;
  //--- @selfCopyInExpressionForGeneration
  const GALGAS_pic_31__38_BraCCTerminator temp_0 = object ;
  callCategoryMethod_getOptimizedTerminators ((const cPtr_pic_31__38_BraCCTerminator *) temp_0.ptr (), constinArgument_inSymbolTable, constinArgument_inBlockList, constinArgument_inBlockLabel, var_optimization, ioArgument_ioListFileContents, var_optimizedTrueTerminator, var_optimizedFalseTerminator, inCompiler COMMA_SOURCE_FILE_AT_LINE (371)) ;
  const enumGalgasBool test_1 = var_optimization.boolEnum () ;
  if (kBoolTrue == test_1) {
    outArgument_outOptimizedTerminator = GALGAS_pic_31__38_BraCCTerminator::constructor_new (var_optimizedTrueTerminator, var_optimizedFalseTerminator, object->mAttribute_mBranchMode, object->mAttribute_mConditionalBranch COMMA_SOURCE_FILE_AT_LINE (381)) ;
    ioArgument_ioOptimizationDone = GALGAS_bool (true) ;
  }else if (kBoolFalse == test_1) {
    //--- @selfCopyInExpressionForGeneration
    const GALGAS_pic_31__38_BraCCTerminator temp_2 = object ;
    outArgument_outOptimizedTerminator = temp_2 ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38_BraCCTerminator_optimizeTerminator (void) {
  enterCategoryMethod_optimizeTerminator (kTypeDescriptor_GALGAS_pic_31__38_BraCCTerminator.mSlotID,
                                          categoryMethod_pic_31__38_BraCCTerminator_optimizeTerminator) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38_BraCCTerminator_optimizeTerminator (defineCategoryMethod_pic_31__38_BraCCTerminator_optimizeTerminator, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@pic18RegisterComparisonTerminator optimizeTerminator'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38_RegisterComparisonTerminator_optimizeTerminator (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                                       const GALGAS_symbolTableForBlockOptimization constinArgument_inSymbolTable,
                                                                                       const GALGAS_ipic_31__38_BlockList constinArgument_inBlockList,
                                                                                       const GALGAS_string constinArgument_inBlockLabel,
                                                                                       GALGAS_bool & ioArgument_ioOptimizationDone,
                                                                                       GALGAS_string & ioArgument_ioListFileContents,
                                                                                       GALGAS_ipic_31__38_AbstractBlockTerminator & outArgument_outOptimizedTerminator,
                                                                                       C_Compiler * inCompiler
                                                                                       COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38_RegisterComparisonTerminator * object = (const cPtr_pic_31__38_RegisterComparisonTerminator *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38_RegisterComparisonTerminator) ;
  GALGAS_bool var_optimization = GALGAS_bool (false) ;
  GALGAS_ipic_31__38_SingleInstructionTerminator var_optimizedTrueTerminator ;
  GALGAS_ipic_31__38_SingleInstructionTerminator var_optimizedFalseTerminator ;
  //--- @selfCopyInExpressionForGeneration
  const GALGAS_pic_31__38_RegisterComparisonTerminator temp_0 = object ;
  callCategoryMethod_getOptimizedTerminators ((const cPtr_pic_31__38_RegisterComparisonTerminator *) temp_0.ptr (), constinArgument_inSymbolTable, constinArgument_inBlockList, constinArgument_inBlockLabel, var_optimization, ioArgument_ioListFileContents, var_optimizedTrueTerminator, var_optimizedFalseTerminator, inCompiler COMMA_SOURCE_FILE_AT_LINE (404)) ;
  const enumGalgasBool test_1 = var_optimization.boolEnum () ;
  if (kBoolTrue == test_1) {
    outArgument_outOptimizedTerminator = GALGAS_pic_31__38_RegisterComparisonTerminator::constructor_new (var_optimizedTrueTerminator, var_optimizedFalseTerminator, object->mAttribute_mRegisterDescription, object->mAttribute_mComparison COMMA_SOURCE_FILE_AT_LINE (414)) ;
    ioArgument_ioOptimizationDone = GALGAS_bool (true) ;
  }else if (kBoolFalse == test_1) {
    //--- @selfCopyInExpressionForGeneration
    const GALGAS_pic_31__38_RegisterComparisonTerminator temp_2 = object ;
    outArgument_outOptimizedTerminator = temp_2 ;
  }
}
//---------------------------------------------------------------------------*

