pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimize_block.cpp
C_PrologueEpilogue gMethod_ipic_31__38_RetfieTerminator_enterTerminatorReferencedLabels (defineCategoryMethod_ipic_31__38_RetfieTerminator_enterTerminatorReferencedLabels, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@ipic18ReturnTerminator enterTerminatorReferencedLabels'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_ReturnTerminator_enterTerminatorReferencedLabels (const cPtr_ipic_31__38_AbstractBlockTerminator * /* inObject */,
                                                                                         GALGAS_stringset & /* ioArgument_ioReferencedBlockSet */,
                                                                                         C_Compiler * /* inCompiler */
                                                                                         COMMA_UNUSED_LOCATION_ARGS) {
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_ReturnTerminator_enterTerminatorReferencedLabels (void) {
  enterCategoryMethod_enterTerminatorReferencedLabels (kTypeDescriptor_GALGAS_ipic_31__38_ReturnTerminator.mSlotID,
                                                       categoryMethod_ipic_31__38_ReturnTerminator_enterTerminatorReferencedLabels) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_ReturnTerminator_enterTerminatorReferencedLabels (defineCategoryMethod_ipic_31__38_ReturnTerminator_enterTerminatorReferencedLabels, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@ipic18RetlwTerminator enterTerminatorReferencedLabels'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_RetlwTerminator_enterTerminatorReferencedLabels (const cPtr_ipic_31__38_AbstractBlockTerminator * /* inObject */,
                                                                                        GALGAS_stringset & /* ioArgument_ioReferencedBlockSet */,
                                                                                        C_Compiler * /* inCompiler */
                                                                                        COMMA_UNUSED_LOCATION_ARGS) {
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_RetlwTerminator_enterTerminatorReferencedLabels (void) {
  enterCategoryMethod_enterTerminatorReferencedLabels (kTypeDescriptor_GALGAS_ipic_31__38_RetlwTerminator.mSlotID,
                                                       categoryMethod_ipic_31__38_RetlwTerminator_enterTerminatorReferencedLabels) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_RetlwTerminator_enterTerminatorReferencedLabels (defineCategoryMethod_ipic_31__38_RetlwTerminator_enterTerminatorReferencedLabels, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@ipic18ComputedRETLWTerminator enterTerminatorReferencedLabels'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_ComputedRETLWTerminator_enterTerminatorReferencedLabels (const cPtr_ipic_31__38_AbstractBlockTerminator * /* inObject */,
                                                                                                GALGAS_stringset & /* ioArgument_ioReferencedBlockSet */,
                                                                                                C_Compiler * /* inCompiler */
                                                                                                COMMA_UNUSED_LOCATION_ARGS) {
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_ComputedRETLWTerminator_enterTerminatorReferencedLabels (void) {
  enterCategoryMethod_enterTerminatorReferencedLabels (kTypeDescriptor_GALGAS_ipic_31__38_ComputedRETLWTerminator.mSlotID,
                                                       categoryMethod_ipic_31__38_ComputedRETLWTerminator_enterTerminatorReferencedLabels) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_ComputedRETLWTerminator_enterTerminatorReferencedLabels (defineCategoryMethod_ipic_31__38_ComputedRETLWTerminator_enterTerminatorReferencedLabels, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@ipic18AbstractConditionTerminator enterTerminatorReferencedLabels'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38_AbstractConditionTerminator_enterTerminatorReferencedLabels (const cPtr_ipic_31__38_AbstractBlockTerminator * inObject,
                                                                                                    GALGAS_stringset & ioArgument_ioReferencedBlockSet,
                                                                                                    C_Compiler * inCompiler
                                                                                                    COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_ipic_31__38_AbstractConditionTerminator * object = (const cPtr_ipic_31__38_AbstractConditionTerminator *) inObject ;
  macroValidSharedObject (object, const cPtr_ipic_31__38_AbstractConditionTerminator) ;
  callCategoryMethod_enterTerminatorReferencedLabels ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionTrue.ptr (), ioArgument_ioReferencedBlockSet, inCompiler COMMA_SOURCE_FILE_AT_LINE (618)) ;
  callCategoryMethod_enterTerminatorReferencedLabels ((const cPtr_ipic_31__38_SingleInstructionTerminator *) object->mAttribute_mInstructionIfConditionFalse.ptr (), ioArgument_ioReferencedBlockSet, inCompiler COMMA_SOURCE_FILE_AT_LINE (619)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38_AbstractConditionTerminator_enterTerminatorReferencedLabels (void) {
  enterCategoryMethod_enterTerminatorReferencedLabels (kTypeDescriptor_GALGAS_ipic_31__38_AbstractConditionTerminator.mSlotID,
                                                       categoryMethod_ipic_31__38_AbstractConditionTerminator_enterTerminatorReferencedLabels) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38_AbstractConditionTerminator_enterTerminatorReferencedLabels (defineCategoryMethod_ipic_31__38_AbstractConditionTerminator_enterTerminatorReferencedLabels, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Category method '@ipic18SequentialInstruction enterInstructionReferencedLabels'*
//                                                                           *
//---------------------------------------------------------------------------*

