pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimize_block.cpp
C_PrologueEpilogue gMethod_ipic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_enterInstructionReferencedLabels (defineCategoryMethod_ipic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_enterInstructionReferencedLabels, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@ipic18_skip_instruction enterInstructionReferencedLabels'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_ipic_31__38__5F_skip_5F_instruction_enterInstructionReferencedLabels (const cPtr_ipic_31__38_SequentialInstruction * inObject,
                                                                                                 GALGAS_stringset & ioArgument_ioReferencedBlockSet,
                                                                                                 C_Compiler * inCompiler
                                                                                                 COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_ipic_31__38__5F_skip_5F_instruction * object = (const cPtr_ipic_31__38__5F_skip_5F_instruction *) inObject ;
  macroValidSharedObject (object, const cPtr_ipic_31__38__5F_skip_5F_instruction) ;
  callCategoryMethod_enterInstructionReferencedLabels ((const cPtr_ipic_31__38_SequentialInstruction *) object->mAttribute_mEmbeddedInstruction.ptr (), ioArgument_ioReferencedBlockSet, inCompiler COMMA_SOURCE_FILE_AT_LINE (656)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_ipic_31__38__5F_skip_5F_instruction_enterInstructionReferencedLabels (void) {
  enterCategoryMethod_enterInstructionReferencedLabels (kTypeDescriptor_GALGAS_ipic_31__38__5F_skip_5F_instruction.mSlotID,
                                                        categoryMethod_ipic_31__38__5F_skip_5F_instruction_enterInstructionReferencedLabels) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_ipic_31__38__5F_skip_5F_instruction_enterInstructionReferencedLabels (defineCategoryMethod_ipic_31__38__5F_skip_5F_instruction_enterInstructionReferencedLabels, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Category method '@ipic18SequentialInstructionList enterInstructionReferencedLabels'*
//                                                                           *
//---------------------------------------------------------------------------*

void categoryMethod_enterInstructionReferencedLabels (const GALGAS_ipic_31__38_SequentialInstructionList inObject,
                                                      GALGAS_stringset & ioArgument_ioReferencedBlockSet,
                                                      C_Compiler * inCompiler
                                                      COMMA_UNUSED_LOCATION_ARGS) {
  //--- @selfCopyInExpressionForGeneration
  const GALGAS_ipic_31__38_SequentialInstructionList temp_0 = inObject ;
  cEnumerator_ipic_31__38_SequentialInstructionList enumerator_22140 (temp_0, kEnumeration_up) ;
  while (enumerator_22140.hasCurrentObject ()) {
    callCategoryMethod_enterInstructionReferencedLabels ((const cPtr_ipic_31__38_SequentialInstruction *) enumerator_22140.current_mInstruction (HERE).ptr (), ioArgument_ioReferencedBlockSet, inCompiler COMMA_SOURCE_FILE_AT_LINE (669)) ;
    enumerator_22140.gotoNextObject () ;
  }
}


//---------------------------------------------------------------------------*
//                                                                           *
//           Category method '@ipic18Block enterReferencedLabels'            *
//                                                                           *
//---------------------------------------------------------------------------*

void categoryMethod_enterReferencedLabels (const GALGAS_ipic_31__38_Block inObject,
                                           GALGAS_stringset & ioArgument_ioReferencedBlockSet,
                                           C_Compiler * inCompiler
                                           COMMA_UNUSED_LOCATION_ARGS) {
  categoryMethod_enterInstructionReferencedLabels (inObject.mAttribute_mInstructionList, ioArgument_ioReferencedBlockSet, inCompiler COMMA_SOURCE_FILE_AT_LINE (678)) ;
  callCategoryMethod_enterTerminatorReferencedLabels ((const cPtr_ipic_31__38_AbstractBlockTerminator *) inObject.mAttribute_mTerminator.ptr (), ioArgument_ioReferencedBlockSet, inCompiler COMMA_SOURCE_FILE_AT_LINE (679)) ;
}


//---------------------------------------------------------------------------*
//                                                                           *
//                  Category method '@ipic18Block optimize'                  *
//                                                                           *
//---------------------------------------------------------------------------*

void categoryMethod_optimize (const GALGAS_ipic_31__38_Block inObject,
                              const GALGAS_symbolTableForBlockOptimization constinArgument_inSymbolTable,
                              const GALGAS_ipic_31__38_BlockList constinArgument_inBlockList,
                              GALGAS_bool & ioArgument_ioOptimizationDone,
                              GALGAS_string & ioArgument_ioListFileContents,
                              GALGAS_ipic_31__38_Block & outArgument_outOptimizedBlock,
                              C_Compiler * inCompiler
                              COMMA_UNUSED_LOCATION_ARGS) {
  outArgument_outOptimizedBlock.drop () ; // Release 'out' argument
  //--- @selfCopyInExpressionForGeneration
  const GALGAS_ipic_31__38_Block temp_0 = inObject ;
  outArgument_outOptimizedBlock = temp_0 ;
  GALGAS_bool var_optimized = GALGAS_bool (false) ;
  GALGAS_ipic_31__38_SequentialInstructionList var_instructionList = inObject.mAttribute_mInstructionList ;
  const enumGalgasBool test_1 = GALGAS_bool (kIsStrictSup, inObject.mAttribute_mInstructionList.reader_length (SOURCE_FILE_AT_LINE (695)).objectCompare (GALGAS_uint ((PMUInt32) 0U))).operator_and (GALGAS_bool (NULL != dynamic_cast <const cPtr_ipic_31__38_ReturnTerminator *> (inObject.mAttribute_mTerminator.ptr ())) COMMA_SOURCE_FILE_AT_LINE (695)).boolEnum () ;
  if (kBoolTrue == test_1) {
    GALGAS_ipic_31__38_SequentialInstruction var_lastInstruction ;
    var_instructionList.method_last (var_lastInstruction, inCompiler COMMA_SOURCE_FILE_AT_LINE (696)) ;
    const enumGalgasBool test_2 = GALGAS_bool (NULL != dynamic_cast <const cPtr_ipic_31__38__5F_intermediate_5F_instruction_5F_literalOperation *> (var_lastInstruction.ptr ())).boolEnum () ;
    if (kBoolTrue == test_2) {
      GALGAS_ipic_31__38__5F_intermediate_5F_instruction_5F_literalOperation temp_3 ;
      if (var_lastInstruction.isValid ()) {
        if (NULL != dynamic_cast <const cPtr_ipic_31__38__5F_intermediate_5F_instruction_5F_literalOperation *> (var_lastInstruction.ptr ())) {
          temp_3 = (cPtr_ipic_31__38__5F_intermediate_5F_instruction_5F_literalOperation *) var_lastInstruction.ptr () ;
        }else{
          inCompiler->castError ("ipic_31__38__5F_intermediate_5F_instruction_5F_literalOperation", var_lastInstruction.ptr ()->classDescriptor () COMMA_SOURCE_FILE_AT_LINE (698)) ;
        }
      }
      GALGAS_ipic_31__38__5F_intermediate_5F_instruction_5F_literalOperation var_op = temp_3 ;
      const enumGalgasBool test_4 = GALGAS_bool (kIsEqual, var_op.reader_mLiteralInstruction (SOURCE_FILE_AT_LINE (699)).objectCompare (GALGAS_literal_5F_instruction_5F_opcode::constructor_MOVLW (SOURCE_FILE_AT_LINE (699)))).boolEnum () ;
      if (kBoolTrue == test_4) {
        {
        GALGAS_ipic_31__38_SequentialInstruction joker_23546_0 ; // Joker input parameter
        var_instructionList.modifier_popLast (joker_23546_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (700)) ;
        }
        GALGAS_ipic_31__38_RetlwTerminator var_newTerminator = GALGAS_ipic_31__38_RetlwTerminator::constructor_new (var_op.reader_mLiteralValue (SOURCE_FILE_AT_LINE (701)) COMMA_SOURCE_FILE_AT_LINE (701)) ;
        outArgument_outOptimizedBlock = GALGAS_ipic_31__38_Block::constructor_new (inObject.mAttribute_mStartAddress, inObject.mAttribute_mLabel, var_instructionList, var_newTerminator COMMA_SOURCE_FILE_AT_LINE (702)) ;
        var_optimized = GALGAS_bool (true) ;
        ioArgument_ioOptimizationDone = GALGAS_bool (true) ;
        ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("  ").operator_concat (inObject.mAttribute_mLabel.reader_string (SOURCE_FILE_AT_LINE (710)) COMMA_SOURCE_FILE_AT_LINE (710)).operator_concat (GALGAS_string (": ") COMMA_SOURCE_FILE_AT_LINE (710)) COMMA_SOURCE_FILE_AT_LINE (710)) ;
        callCategoryMethod_display ((const cPtr_ipic_31__38_AbstractBlockTerminator *) inObject.mAttribute_mTerminator.ptr (), ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (711)) ;
        ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" -> ") COMMA_SOURCE_FILE_AT_LINE (712)) ;
        callCategoryMethod_display ((const cPtr_ipic_31__38_RetlwTerminator *) var_newTerminator.ptr (), ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (713)) ;
        ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (714)) ;
      }
    }
    const enumGalgasBool test_5 = var_optimized.operator_not (SOURCE_FILE_AT_LINE (718)).operator_and (GALGAS_bool (NULL != dynamic_cast <const cPtr_ipic_31__38__5F_intermediate_5F_JSR *> (var_lastInstruction.ptr ())) COMMA_SOURCE_FILE_AT_LINE (718)).boolEnum () ;
    if (kBoolTrue == test_5) {
      GALGAS_ipic_31__38__5F_intermediate_5F_JSR temp_6 ;
      if (var_lastInstruction.isValid ()) {
        if (NULL != dynamic_cast <const cPtr_ipic_31__38__5F_intermediate_5F_JSR *> (var_lastInstruction.ptr ())) {
          temp_6 = (cPtr_ipic_31__38__5F_intermediate_5F_JSR *) var_lastInstruction.ptr () ;
        }else{
          inCompiler->castError ("ipic_31__38__5F_intermediate_5F_JSR", var_lastInstruction.ptr ()->classDescriptor () COMMA_SOURCE_FILE_AT_LINE (719)) ;
        }
      }
      GALGAS_ipic_31__38__5F_intermediate_5F_JSR var_jsr = temp_6 ;
      {
      GALGAS_ipic_31__38_SequentialInstruction joker_24368_0 ; // Joker input parameter
      var_instructionList.modifier_popLast (joker_24368_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (720)) ;
      }
      GALGAS_ipic_31__38_JumpTerminator var_newTerminator = GALGAS_ipic_31__38_JumpTerminator::constructor_new (var_jsr.reader_mTargetLabel (SOURCE_FILE_AT_LINE (721)) COMMA_SOURCE_FILE_AT_LINE (721)) ;
      outArgument_outOptimizedBlock = GALGAS_ipic_31__38_Block::constructor_new (inObject.mAttribute_mStartAddress, inObject.mAttribute_mLabel, var_instructionList, var_newTerminator COMMA_SOURCE_FILE_AT_LINE (722)) ;
      var_optimized = GALGAS_bool (true) ;
      ioArgument_ioOptimizationDone = GALGAS_bool (true) ;
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("  ").operator_concat (inObject.mAttribute_mLabel.reader_string (SOURCE_FILE_AT_LINE (730)) COMMA_SOURCE_FILE_AT_LINE (730)).operator_concat (GALGAS_string (": ") COMMA_SOURCE_FILE_AT_LINE (730)) COMMA_SOURCE_FILE_AT_LINE (730)) ;
      callCategoryMethod_display ((const cPtr_ipic_31__38_AbstractBlockTerminator *) inObject.mAttribute_mTerminator.ptr (), ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (731)) ;
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" -> ") COMMA_SOURCE_FILE_AT_LINE (732)) ;
      callCategoryMethod_display ((const cPtr_ipic_31__38_JumpTerminator *) var_newTerminator.ptr (), ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (733)) ;
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (734)) ;
    }
  }
  const enumGalgasBool test_7 = var_optimized.operator_not (SOURCE_FILE_AT_LINE (738)).boolEnum () ;
  if (kBoolTrue == test_7) {
    GALGAS_ipic_31__38_AbstractBlockTerminator var_optimizedTerminator ;
    callCategoryMethod_optimizeTerminator ((const cPtr_ipic_31__38_AbstractBlockTerminator *) inObject.mAttribute_mTerminator.ptr (), constinArgument_inSymbolTable, constinArgument_inBlockList, inObject.mAttribute_mLabel.mAttribute_string, ioArgument_ioOptimizationDone, ioArgument_ioListFileContents, var_optimizedTerminator, inCompiler COMMA_SOURCE_FILE_AT_LINE (739)) ;
    outArgument_outOptimizedBlock = GALGAS_ipic_31__38_Block::constructor_new (inObject.mAttribute_mStartAddress, inObject.mAttribute_mLabel, inObject.mAttribute_mInstructionList, var_optimizedTerminator COMMA_SOURCE_FILE_AT_LINE (747)) ;
  }
}


//---------------------------------------------------------------------------*

GALGAS_symbolTableForBlockOptimization_2E_element::GALGAS_symbolTableForBlockOptimization_2E_element (void) :
mAttribute_lkey (),
mAttribute_mDefinitionBlockIndex () {
}

//---------------------------------------------------------------------------*

GALGAS_symbolTableForBlockOptimization_2E_element::~ GALGAS_symbolTableForBlockOptimization_2E_element (void) {
}

//---------------------------------------------------------------------------*

