pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimize_block.cpp
GALGAS_symbolTableForBlockOptimization_2E_element::GALGAS_symbolTableForBlockOptimization_2E_element (const GALGAS_lstring & inOperand0,
                                                                                                      const GALGAS_uint & inOperand1) :
mAttribute_lkey (inOperand0),
mAttribute_mDefinitionBlockIndex (inOperand1) {
}

//---------------------------------------------------------------------------*

GALGAS_symbolTableForBlockOptimization_2E_element GALGAS_symbolTableForBlockOptimization_2E_element::constructor_default (UNUSED_LOCATION_ARGS) {
  return GALGAS_symbolTableForBlockOptimization_2E_element (GALGAS_lstring::constructor_default (HERE),
                                                            GALGAS_uint::constructor_default (HERE)) ;
}

//---------------------------------------------------------------------------*

GALGAS_symbolTableForBlockOptimization_2E_element GALGAS_symbolTableForBlockOptimization_2E_element::constructor_new (const GALGAS_lstring & inOperand0,
                                                                                                                      const GALGAS_uint & inOperand1 
                                                                                                                      COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_symbolTableForBlockOptimization_2E_element result ;
  if (inOperand0.isValid () && inOperand1.isValid ()) {
    result = GALGAS_symbolTableForBlockOptimization_2E_element (inOperand0, inOperand1) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

typeComparisonResult GALGAS_symbolTableForBlockOptimization_2E_element::objectCompare (const GALGAS_symbolTableForBlockOptimization_2E_element & inOperand) const {
   typeComparisonResult result = kOperandEqual ;
  if (result == kOperandEqual) {
    result = mAttribute_lkey.objectCompare (inOperand.mAttribute_lkey) ;
  }
  if (result == kOperandEqual) {
    result = mAttribute_mDefinitionBlockIndex.objectCompare (inOperand.mAttribute_mDefinitionBlockIndex) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

bool GALGAS_symbolTableForBlockOptimization_2E_element::isValid (void) const {
  return mAttribute_lkey.isValid () && mAttribute_mDefinitionBlockIndex.isValid () ;
}

//---------------------------------------------------------------------------*

void GALGAS_symbolTableForBlockOptimization_2E_element::drop (void) {
  mAttribute_lkey.drop () ;
  mAttribute_mDefinitionBlockIndex.drop () ;
}

//---------------------------------------------------------------------------*

void GALGAS_symbolTableForBlockOptimization_2E_element::description (C_String & ioString,
                                                                     const PMSInt32 inIndentation) const {
  ioString << "<struct @symbolTableForBlockOptimization.element:" ;
  if (! isValid ()) {
    ioString << " not built" ;
  }else{
    mAttribute_lkey.description (ioString, inIndentation+1) ;
    ioString << ", " ;
    mAttribute_mDefinitionBlockIndex.description (ioString, inIndentation+1) ;
  }
  ioString << ">" ;
}

//---------------------------------------------------------------------------*

GALGAS_lstring GALGAS_symbolTableForBlockOptimization_2E_element::reader_lkey (UNUSED_LOCATION_ARGS) const {
  return mAttribute_lkey ;
}

//---------------------------------------------------------------------------*

GALGAS_uint GALGAS_symbolTableForBlockOptimization_2E_element::reader_mDefinitionBlockIndex (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mDefinitionBlockIndex ;
}



//---------------------------------------------------------------------------*
//                                                                           *
//               @symbolTableForBlockOptimization.element type               *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_symbolTableForBlockOptimization_2E_element ("symbolTableForBlockOptimization.element",
                                                                   NULL) ;

//---------------------------------------------------------------------------*

const C_galgas_type_descriptor * GALGAS_symbolTableForBlockOptimization_2E_element::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_symbolTableForBlockOptimization_2E_element ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_symbolTableForBlockOptimization_2E_element::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_symbolTableForBlockOptimization_2E_element (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_symbolTableForBlockOptimization_2E_element GALGAS_symbolTableForBlockOptimization_2E_element::extractObject (const GALGAS_object & inObject,
                                                                                                                    C_Compiler * inCompiler
                                                                                                                    COMMA_LOCATION_ARGS) {
  GALGAS_symbolTableForBlockOptimization_2E_element result ;
  const GALGAS_symbolTableForBlockOptimization_2E_element * p = (const GALGAS_symbolTableForBlockOptimization_2E_element *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_symbolTableForBlockOptimization_2E_element *> (p)) {
      result = *p ;
    }else{
      inCompiler->castError ("symbolTableForBlockOptimization.element", p->dynamicTypeDescriptor () COMMA_THERE) ;
    }  
  }
  return result ;
}

//--- START OF USER ZONE 2


//--- END OF USER ZONE 2


